# Пример условий отбора:
# Время матча: 28 минута
EVENT_TIME = "25-35"  # or >28 or <28 or <=28 or >=28 or 0-28 or 28-60
# Владение мячом: первая или вторая команда - не менее 60%
POSSESSION = ">=55"
# С БОЛЬШИМ ВЛАДЕНИЕМ УДАРЫ
LEADER_SHOOT = ">=5"
# С МЕНЬШИМ ВЛАДЕНИЕМ УДАРЫ
LOSER_SHOOT = "<=2"
# С БОЛЬШИМ ВЛАДЕНИЕМ УДАРЫ В СТВОР
LEADER_SHOOT_ON_TARGET = ">=3"
# С МЕНЬШИМ ВЛАДЕНИЕМ УДАРЫ В СТВОР
LOSER_SHOOT_ON_TARGET = "<=1"


CONFIG_FILE = 'config.yml'
LEAGUES_FILE = 'leagues.txt'


def create_config_file():
    data = {
        'event_time': EVENT_TIME,
        'possession': POSSESSION,
        'leader_shoot': LEADER_SHOOT,
        'loser_shoot': LOSER_SHOOT,
        'leader_shoot_on_target': LEADER_SHOOT_ON_TARGET,
        'loser_shoot_on_target': LOSER_SHOOT_ON_TARGET
    }
    from yaml import YAMLError, safe_dump

    with open(CONFIG_FILE, 'w') as f:
        try:
            safe_dump(data, f)
        except YAMLError as exc:
            print(exc)


def create_file_leagues():
    leagues = ["Австралия: Лига А",
               "Австрия: Бундеслига",
               "Англия: Премьер-лига",
               "Англия: Чемпионшип",
               "Англия: Первая лига",
               "Англия: Вторая лига",
               "Англия: Кубок ФА",
               "Англия: Кубок Английской лиги",
               "Аргентина: Лига професиональ",
               "Аргентина: Примера насьональ",
               "Аргентина: Суперкубок",
               "Африка: Чемпионат африканских наций",
               "Бельгия: Высшая лига",
               "Бельгия: Challenger pro league",
               "Болгария: Первая лига",
               "Босния и Герцеговина: Премьер-лига",
               "Бразилия: Чемпионат Бразилии",
               "Бразилия: Чемпионат Бразилии В",
               "Венгрия: Высшая лига",
               "Венесуэла: Высший дивизион",
               "Германия: Бундеслига",
               "Германия: Вторая бундеслига",
               "Германия: Третья лига",
               "Греция: Суперлига",
               "Греция: Кубок Греции",
               "Дания: Первый дивизион",
               "Европа: Евро",
               "Европа: Лига Чемпионов",
               "Европа: Лига Европы",
               "Европа: Лига наций УЕФА",
               "Европа: Суперкубок УЕФА",
               "Египет: Премьер-лига",
               "Израиль: Суперлига",
               "Индия: Суперлига",
               "Испания: Примера",
               "Испания: Сегунда",
               "Испания: Кубок Испании",
               "Испания: Суперкубок",
               "Италия: Серия А",
               "Италия: Серия В",
               "Италия: Кубок Италии",
               "Катар: Лига катар Старс",
               "Кипр: Первый дивизион",
               "Китай: Суперлига",
               "Мир: Чемпионат мира",
               "Нидерланды: Высшая лига",
               "Нидерланды: Кубок Нидерландов",
               "ОАЭ: Первый дивизион",
               "Польша: Премьер-лига",
               "Португалия: Чемпионат Португалии",
               "Португалия: Вторая лига",
               "Португалия: Кубок лиги",
               "Румыния: Высшая лига",
               "Саудовская Аравия: Премьер-лига",
               "Словения: Первая лига",
               "США: МЛС",
               "Турция: Суперлига",
               "Турция: Первая лига",
               "Узбекистан: Суперлига",
               "Франция: Первая лига",
               "Франция: Вторая лига",
               "Франция: Кубок лиги",
               "Хорватия: NHL",
               "Черногория: Первая лига",
               "Чехия: Первая лига",
               "Чили: Высший дивизион",
               "Швейцария: Суперлига",
               "Швеция: Высшая лига",
               "Шотландия: Премьер-лига",
               "Эстония: Высшая лига",
               "Южная Африка: Премьер-лига",
               "Южная Корея: К-Лига 1",
               "Япония: Лига Джей-1",
               # "Северная и Центральная Америка: Лига Чемпионов Конкакаф",
               #  "МЕКСИКА: ЛИГА ЭКСПАНСЬОН МХ"
               ]
    with open(LEAGUES_FILE, "w") as f:
        f.write("\n".join(leagues))


if __name__ == "__main__":
    print(f"{EVENT_TIME=}")
    print(f"{POSSESSION=}")
    print(f"{LEADER_SHOOT=}")
    print(f"{LOSER_SHOOT=}")
    print(f"{LEADER_SHOOT_ON_TARGET=}")
    print(f"{LOSER_SHOOT_ON_TARGET=}")

    create_config_file()
    create_file_leagues()
